-- 由 VBA 脚本生成
-- 生成时间: 2026/10/18/星期日 21:07:04
-- 输出路径：D:\Workspace\War3\Projects\Suffer\Suffer\scripts\mlua\data\
local True = true
local False = false
return {
  -- 工作表: 单位数据
  ['单位数据'] = {
    ['Obla'] = {
      ['名称'] = [[剑圣]],
      ['最小攻击'] = 100,
      ['最大攻击'] = 125,
      ['最小防御'] = 20,
      ['最大防御'] = 25,
      ['最大生命'] = 1000,
      ['最大护甲'] = 500,
      ['攻击类型'] = [[近战]],
      ['武器声音'] = [[金属重切]],
    },
  },
  -- 工作表: 键值
  ['键值'] = {
    ['单位数据'] = {
      [1] = [[名称]],
      [2] = [[最小攻击]],
      [3] = [[最大攻击]],
      [4] = [[最小防御]],
      [5] = [[最大防御]],
      [6] = [[最大生命]],
      [7] = [[最大护甲]],
      [8] = [[攻击类型]],
      [9] = [[武器声音]],
    },
  },
}
